app/views/posts/show.html.erb

        <div class = "comment">
          <% unless comment.user.blank? %>
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1  [["id", 1], ["LIMIT", 1]]