app/controllers/comments_controller.rb

  def create
    @comment = current_user.comments.build(comment_params)
    @comment.post_id = params[:post_id]
    if @comment.save
      flash[:success] = 'コメントしました'
      redirect_to @comment.post
    else
      @post = Post.find(params[:micropost_id])
---
INSERT INTO `comments` (`content`, `user_id`, `post_id`, `created_at`, `updated_at`) VALUES ('ssss', 1, 1, '2020-04-23 09:43:43', '2020-04-23 09:43:43')
SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1