app/controllers/posts_controller.rb

  def index
    @posts = Post.includes(:user)
---
SELECT  `posts`.* FROM `posts` LIMIT 1
SELECT  `users`.* FROM `users` LIMIT 1

  def create
    # binding.pry
    Post.create(post_params)
---
INSERT INTO `posts` (`title`, `content`, `created_at`, `updated_at`, `image`, `user_id`) VALUES ('今は朝。。。', '気づいたら朝\r\nセキュリティーは大事ですね', '2020-03-16 21:09:46', '2020-03-16 21:09:46', '20200317060946.jpg', 1)

  def show
    @user = User.find_by(params[:id])
    @post = Post.find(params[:id])
---
SELECT  `users`.* FROM `users` WHERE (3) LIMIT 1
SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1

  def update
    post = Post.find(params[:id])
    post.update(post_params)
---
SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 4 LIMIT 1
UPDATE `posts` SET `image` = '20200405021146.jpg', `updated_at` = '2020-04-04 17:11:46' WHERE `posts`.`id` = 4

  def destroy
    post = Post.find(params[:id])
    post.destroy
---
SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 3 LIMIT 1
DELETE FROM `posts` WHERE `posts`.`id` = 1