app/controllers/users_controller.rb

  def index
    @users = User.paginate(page: params[:page])                                 # Userを取り出して分割した値を@usersに代入
---
SELECT  "users".* FROM "users" LIMIT ? OFFSET ?  [["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM `users`

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO `users` (`name`, `email`, `created_at`, `updated_at`, `password_digest`, `activation_digest`) VALUES ('RYOTA MAEDA', 'rh.bicmac@gmail.com', '2020-04-03 08:17:42', '2020-04-03 08:17:42', '$2a$12$OHggWImiR1oMt2udODitG.wuhgEwewnCG7bud7AmUKZGfdEbbc3ym', '$2a$12$ScHrlFA1F8kBpkOXuzOFeOBc5pyOoLfYxObr9HeANA/72huiWMuwm')

  def update
    @user = User.find(params[:id])
    if @user.update_attributes(user_params)
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1  [["id", 1], ["LIMIT", 1]]
UPDATE `users` SET `password_digest` = '$2a$12$ZhpGkR0F8nU7MPqJgEKULeoElz03x4Xp8J2eanG1C.5PNzgn4C3tu', `updated_at` = '2020-03-17 02:36:04' WHERE `users`.`id` = 1

    def correct_user
      @user = User.find(params[:id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1